Play/Examples.xml


<!-- Example Template -->

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <u:Action xmlns:u="serviceType"></u:Action>
  </s:Body>
</s:Envelope>


<!-- Browse Query -->

METHOD: POST http://YOUR_SPEAKER_IP:1400/MediaServer/ContentDirectory/Control
HEADER: SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"
BODY:
<?xml version="1.0" encoding="utf-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1">
      <ObjectID>A:ARTIST</ObjectID>
      <BrowseFlag>BrowseDirectChildren</BrowseFlag>
      <Filter>*</Filter>
      <StartingIndex>0</StartingIndex>
      <RequestCount>10</RequestCount>
      <SortCriteria>*</SortCriteria>
    </u:Browse>
  </s:Body>
</s:Envelope>

RESPONSE:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:BrowseResponse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1">
      <Result>
        <DIDL-Lite xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:upnp="urn:schemas-upnp-org:metadata-1-0/upnp/" xmlns:r="urn:schemas-rinconnetworks-com:metadata-1-0/" xmlns="urn:schemas-upnp-org:metadata-1-0/DIDL-Lite/">
          <container id="A:ARTIST/Album%20Leaf" parentID="A:ARTIST" restricted="true">
            <dc:title>Album Leaf</dc:title>
            <upnp:class>object.container.person.musicArtist</upnp:class>
            <res protocolInfo="x-rincon-playlist:*:*:*">x-rincon-playlist:RINCON_000E58D0540801400#A:ARTIST/Album%20Leaf</res>
          </container>
          <container id="A:ARTIST/Angels%20%26%20Airwaves" parentID="A:ARTIST" restricted="true">
            <dc:title>Angels &amp;amp; Airwaves</dc:title>
            <upnp:class>object.container.person.musicArtist</upnp:class>
            <res protocolInfo="x-rincon-playlist:*:*:*">x-rincon-playlist:RINCON_000E58D0540801400#A:ARTIST/Angels%20%26%20Airwaves</res>
          </container>
          <container id="A:ARTIST/Blackbird%20Blackbird" parentID="A:ARTIST" restricted="true">
            <dc:title>Blackbird Blackbird</dc:title>
            <upnp:class>object.container.person.musicArtist</upnp:class>
            <res protocolInfo="x-rincon-playlist:*:*:*">x-rincon-playlist:RINCON_000E58D0540801400#A:ARTIST/Blackbird%20Blackbird</res>
          </container>
          <container id="A:ARTIST/Calmsound" parentID="A:ARTIST" restricted="true">
            <dc:title>Calmsound</dc:title>
            <upnp:class>object.container.person.musicArtist</upnp:class>
            <res protocolInfo="x-rincon-playlist:*:*:*">x-rincon-playlist:RINCON_000E58D0540801400#A:ARTIST/Calmsound</res>
          </container>
          <container id="A:ARTIST/Damien%20Rice" parentID="A:ARTIST" restricted="true">
            <dc:title>Damien Rice</dc:title>
            <upnp:class>object.container.person.musicArtist</upnp:class>
            <res protocolInfo="x-rincon-playlist:*:*:*">x-rincon-playlist:RINCON_000E58D0540801400#A:ARTIST/Damien%20Rice</res>
          </container>
        </DIDL-Lite>
      </Result>
      <NumberReturned>5</NumberReturned>
      <TotalMatches>28</TotalMatches>
      <UpdateID>0</UpdateID>
    </u:BrowseResponse>
  </s:Body>
</s:Envelope>


<!-- Error Response -->

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <s:Fault>
      <faultcode>s:Client</faultcode>
      <faultstring>UPnPError</faultstring>
      <detail>
        <UPnPError xmlns="urn:schemas-upnp-org:control-1-0">
          <errorCode>701</errorCode>
        </UPnPError>
      </detail>
    </s:Fault>
  </s:Body>
</s:Envelope>
